---
kind: property
id: P:Autodesk.Revit.DB.ElementArray.Item(System.Int32)
source: html/b190570f-d265-4101-6a29-f5562245944b.htm
---
# Autodesk.Revit.DB.ElementArray.Item Property

Gets or sets an element at a specified index within the array.

## Syntax (C#)
```csharp
public virtual Element this[
	int index
] { get; set; }
```

## Parameters
- **index** (`System.Int32`) - The index of the element to be set or retrieved.

## Returns
Returns the element at the specified index.